[{
  "_id": {
    "$oid": "6561a9f98ff953033880c83e"
  },
  "name": "Dolycoris baccarum",
  "p_image": "pest/1.jpg",
  "description": "\"Dolycoris baccarum,\" commonly known as the sloe bug or the hairy shield bug, is a species of shield bug belonging to the family Pentatomidae. \r\n• Physical Appearance: The adult sloe bug is about 9 to 11 millimeters long. It has a distinctive shield-shaped body and is generally brown or grayish with reddish or yellow markings. The body is covered in fine hairs, giving it a somewhat hairy appearance.\r\n• Life Cycle: These bugs undergo incomplete metamorphosis, passing through egg, nymph, and adult stages. They typically lay eggs in spring, and the nymphs undergo several molts before reaching adulthood.",
  "prevention": "1. Cultural Control: Keep the garden or agricultural area free from weeds and debris where these bugs might seek shelter. Regularly remove fallen fruits, as they can attract and harbor these pests.\r\n2. Physical Barriers: Use physical barriers such as fine netting or row covers to prevent the bugs from reaching crops or plants.\r\n3. Natural Predators: Encourage natural predators like birds, parasitic wasps, or certain spiders that feed on these bugs.\r\n4. Neem Oil: Derived from the neem tree, it disrupts the insect's growth and acts as a repellent.\r\n5. Insecticidal Soaps: These soaps break down the insect's protective outer layer, causing dehydration and death.\r\n6. Pyrethrin-Based Sprays: Derived from chrysanthemum flowers, pyrethrins are effective against a wide range of insects.",
  "pesticides": "1. Cyfluthrin 5% EW\r\n2. Lambda-Cyhalothrin: Another synthetic pyrethroid effective against various insect pests, including shield bugs.\r\n3. Bifenthrin: A broad-spectrum synthetic pyrethroid used to control many different insects by disrupting their nervous system.\r\n\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Wear appropriate protective clothing and gear when handling and applying pesticides.\r\n• Apply pesticides during the early stages of infestation or as a preventive measure for better control.\r\n• Ensure thorough coverage of the affected plants, including both upper and lower leaf surfaces where bugs tend to hide.\r\nAlways remember that while pesticides can be effective, they should be used judiciously and as part of an integrated pest management (IPM) approach. This means combining various methods such as cultural practices, natural predators, and targeted pesticide use to minimize environmental impact and maximize effectiveness. Additionally, consider the potential impact of pesticides on beneficial insects and other non-target organisms when using them.",
  "pest_image": [
    "pesticides/lambda-cyhalothrin.jpg",
    "pesticides/cyfluthrin.jpg",
    "pesticides/bifenthrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561b7c2c7b2d08c0a1d8e73"
  },
  "name": "Lycorma delicatula",
  "p_image": "pest/2.jpg",
  "description": "Lycorma delicatula, commonly known as the spotted lanternfly, is an invasive insect native to parts of Asia. \r\n• Physical Appearance: The spotted lanternfly has distinct features. Early nymphs are black with white spots, while later stages and adults display red and black wing patterns with white spots.\r\n• Life Cycle: They undergo incomplete metamorphosis, progressing through egg, nymph, and adult stages. The egg masses, laid on various surfaces, resemble a grey, putty-like substance.\r\n\r\n  ",
  "prevention": "• Scraping Egg Masses: Remove and destroy egg masses by scraping them off surfaces like trees, rocks, or other outdoor items where they're laid.\r\n• Tree Banding: Wrapping trees with sticky bands or barriers prevents nymphs from climbing up and developing into adults.\r\n• Pesticide Treatment: Apply pesticides early in the nymph stage on affected plants or areas where infestation is spotted.",
  "pesticides": "1. Imidacloprid and Dinotefuran (Systemic Insecticides):\r\n• Application Method: Typically applied as soil drenches or injections around the base of trees.\r\n• Dosage: The application rate might range from 0.1 milliliters to 1 milliliter per inch of the tree's diameter, depending on the concentration and product specifications.\r\n2. Bifenthrin and Carbaryl (Contact Insecticides):\r\n• Application Method: Usually applied as sprays directly onto the insects or infested areas.\r\n• Dosage: The application rates might range from 1 to 10 milliliters per liter of water, depending on the concentration and the extent of the infestation.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/imidacloprid.jpg",
    "pesticides/dinotefuran.jpeg",
    "pesticides/bifenthrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f703c9b0e3a20fdd61a6"
  },
  "name": "Eurydema dominulus",
  "p_image": "pest/3.jpg",
  "description": "\"Eurydema dominulus,\" commonly known as the Sloe Bug or the Hairy Shield Bug, is a species of shield bug belonging to the family Pentatomidae. \n• Physical Appearance: Eurydema dominulus typically measures around 8-11 millimeters in length. They have a shield-shaped body, often with a distinct red and black coloration. The body is covered with fine hairs, giving it a somewhat hairy appearance.\n• Life Cycle:  These bugs undergo incomplete metamorphosis, progressing through egg, nymph, and adult stages. They feed on plant sap and can cause damage to crops like fruit trees and various garden plants.\n• Crops Affected: Cole crops, beans, spinach",
  "prevention": "• Sanitation: Keeping the garden or agricultural area free from weeds and debris can help reduce hiding spots for these bugs.\r\n• Physical Barriers: Use fine mesh netting or row covers to prevent bugs from accessing plants.\r\n• Natural Predators: Encouraging natural predators like birds, spiders, and parasitic wasps that feed on these bugs can help control their population.",
  "pesticides": "1. Cyfluthrin: A synthetic pyrethroid that targets various insects by disrupting their nervous systems.\r\n2. Lambda-Cyhalothrin: Another synthetic pyrethroid effective against a broad spectrum of insects, including shield bugs.\r\n3. Bifenthrin: A pyrethroid used to control many different insects by disrupting their nervous systems.\r\n4. Neem Oil: Derived from neem tree seeds, it disrupts the insect's growth and acts as a repellent.\r\n5. Insecticidal Soaps: These soaps penetrate and break down the insect's protective outer layer, causing dehydration and death.\r\n6. Pyrethrin-Based Sprays: Derived from chrysanthemum flowers, pyrethrins are effective against a wide range of insects.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/bifenthrin.jpg",
    "pesticides/cyfluthrin.jpg",
    "pesticides/lambda-cyhalothrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f751c9b0e3a20fdd61a7"
  },
  "name": "Pieris rapae",
  "p_image": "pest/4.jpg",
  "description": "\"Pieris rapae,\" commonly known as the small white cabbage butterfly or cabbage white, is a pest that primarily affects plants in the cabbage family.  \n• Physical Appearance: The small white cabbage butterfly has white wings with black markings. Its caterpillars are green with yellow stripes and feed on cruciferous plants.\n• Life Cycle: They undergo complete metamorphosis, progressing through egg, larva (caterpillar), pupa, and adult stages.\n• Crops Affected: Cauliflower, broccoli",
  "prevention": "• Crop Rotation: Avoid planting cruciferous crops in the same area each year to disrupt the life cycle of the pest.\r\n• Physical Barriers: Covering plants with fine netting or row covers can prevent adult butterflies from laying eggs on the crops.\r\n• Handpicking: Remove caterpillars by hand when observed on plants.",
  "pesticides": "1. Spinosad, Pyrethroids (e.g., Permethrin), Carbamates:\r\n• Similar to natural pesticides, these are also applied as sprays directly onto the caterpillars or infested areas.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 1 to 10 milliliters per liter of water for spray applications, but precise rates should be obtained from the product label.\r\n2. Neem Oil, Insecticidal Soaps, Bacillus thuringiensis (Bt):\r\n• These are usually applied as sprays directly onto the caterpillars or infested plants.\r\n• Application rates may vary based on the concentration of the product and the targeted pest.\r\n• Rates could range from 1 to 5 milliliters per liter of water for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/spinosad.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f784c9b0e3a20fdd61a8"
  },
  "name": "Halyomorpha halys",
  "p_image": "pest/5.jpg",
  "description": "\"Halyomorpha halys,\" commonly known as the brown marmorated stink bug (BMSB), is an invasive pest that affects various crops and can become a nuisance when it invades homes.  \r\n• Physical Appearance: The brown marmorated stink bug is shield-shaped with marbled brown coloring and distinctive white bands on its antennae.\r\n• Life Cycle: They undergo incomplete metamorphosis, progressing from egg to nymph and finally adult stages.",
  "prevention": "• Exclusion Techniques: Seal entry points in buildings, including cracks, gaps in doors, windows, and vents, to prevent them from entering homes.\r\n• Habitat Management: Remove vegetation close to buildings and reduce areas of clutter that could provide hiding spots for the bugs.\r\n• Physical Barriers: Use fine mesh netting or row covers in agriculture to prevent bugs from accessing crops.",
  "pesticides": "1. Pyrethroids (e.g., Bifenthrin, Cyfluthrin), Carbamates, Organophosphates:\r\n• Similar to natural pesticides, these are also applied as sprays directly onto the stink bugs or infested areas.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 1 to 10 milliliters per liter of water for spray applications, but precise rates should be obtained from the product label.\r\n2. Insecticidal Soaps, Neem Oil, Pyrethrin-based Sprays, Kaolin Clay:\r\n• These are usually applied as sprays directly onto the stink bugs or infested areas.\r\n• Application rates may vary based on the concentration of the product and the targeted pest.\r\n• Rates could range from 1 to 5 milliliters per liter of water for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/bifenthrin.jpg",
    "pesticides/organophosphates.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f7bfc9b0e3a20fdd61a9"
  },
  "name": "Spilosoma obliqua",
  "p_image": "pest/6.jpg",
  "description": "\"Spilosoma obliqua,\" commonly known as the Common Wasp Moth or the Orange Wasp Moth, is a species of moth known for its distinctive appearance and sometimes considered a garden pest. \r\n• Physical Appearance: Spilosoma obliqua typically has a bright orange or yellow body with black spots and clear wings.\r\n• Life Cycle: As with most moths, it undergoes a complete metamorphosis, progressing through egg, larva (caterpillar), pupa, and adult stages.",
  "prevention": "• Habitat Modification: Remove weeds, overgrown vegetation, and debris from the garden to minimize potential habitats for the caterpillars.\r\n• Handpicking: Physically remove caterpillars from plants if they are causing damage.\r\n• Natural Predators: Encourage natural enemies such as birds, spiders, and parasitic wasps that feed on caterpillars.",
  "pesticides": "1. Spinosad, Pyrethroids (e.g., Bifenthrin), Carbamates:\r\n• Similar to natural pesticides, these are also applied as sprays directly onto the caterpillars or infested areas.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 1 to 10 milliliters per liter of water for spray applications, but precise rates should be obtained from the product label.\r\n2. Bacillus thuringiensis (Bt), Neem Oil, Pyrethrin-based Sprays:\r\n• These are usually applied as sprays directly onto the caterpillars or infested plants.\r\n• Application rates may vary based on the concentration of the product and the targeted pest.\r\n• Rates could range from 1 to 5 milliliters per liter of water for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action. ",
  "pest_image": [
    "pesticides/spinosad.jpg",
    "pesticides/bifenthrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f7f5c9b0e3a20fdd61aa"
  },
  "name": "Graphosoma rubrolineata",
  "p_image": "pest/7.jpg",
  "description": "\"Graphosoma rubrolineata,\" commonly known as the Graphosoma lineatum or Striped Shield Bug or Minstrel Bug, it is a colorful and distinct shield bug species found in Europe and parts of Asia. \r\n• Physical Appearance: The Graphosoma lineatum is a shield-shaped bug with striking red and black stripes on its body.\r\n• Life Cycle: Often found in meadows, fields, and gardens, primarily feeding on plants in the mint family (Lamiaceae).",
  "prevention": "• Habitat Management: Minimize excessive vegetation or debris around gardens to reduce potential habitats for shield bugs.\r\n• Natural Predators: Encourage natural predators like birds, spiders, and predatory insects that feed on shield bugs.",
  "pesticides": "1. Pyrethroids (e.g., Bifenthrin), Carbamates, Organophosphates:\r\n• Similar to natural pesticides, these are also applied as sprays directly onto the shield bugs or infested areas.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 1 to 10 milliliters per liter of water for spray applications, but precise rates should be obtained from the product label.\r\n2. Neem Oil, Insecticidal Soaps, Pyrethrin-based Sprays:\r\n• These are typically applied as sprays directly onto the shield bugs or infested plants.\r\n• Application rates may vary based on the concentration of the product and the targeted pest.\r\n• Rates could range from 1 to 5 milliliters per liter of water for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/organophosphates.jpg",
    "pesticides/pyrethroids.jpg",
    "pesticides/bifenthrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f835c9b0e3a20fdd61ab"
  },
  "name": "Luperomorpha suturalis",
  "p_image": "pest/8.jpg",
  "description": "\"Luperomorpha suturalis,\" commonly known as the Passionvine Flea Beetle, is a species of flea beetle known to feed on plants, particularly those in the Passifloraceae family (passionflowers).  \r\n• Physical Appearance: The Passionvine Flea Beetle is typically small and metallic blue-black in color with distinctive markings. Adults have enlarged hind legs, characteristic of flea beetles.\r\n• Life Cycle: They are commonly found on plants of the Passifloraceae family, such as passionflowers.",
  "prevention": "• Habitat Modification: Minimize the presence of host plants in areas where their feeding can cause significant damage.\r\n• Physical Barriers: Use fine mesh netting or row covers to prevent adult beetles from accessing and feeding on plants.",
  "pesticides": "1. Pyrethroids (e.g., Bifenthrin), Carbamates, Organophosphates:\r\n• Similar to natural pesticides, these are also applied as sprays directly onto the beetles or infested areas.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 1 to 10 milliliters per liter of water for spray applications, but precise rates should be obtained from the product label.\r\n2. Neem Oil, Insecticidal Soaps, Pyrethrin-based Sprays:\r\n• These are usually applied as sprays directly onto the flea beetles or infested plants.\r\n• Application rates may vary based on the concentration of the product and the targeted pest.\r\n• Rates could range from 1 to 5 milliliters per liter of water for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/bifenthrin.jpg",
    "pesticides/organophosphates.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f85ec9b0e3a20fdd61ac"
  },
  "name": "Leptocorisa acuta",
  "p_image": "pest/9.jpg",
  "description": "\"Leptocorisa acuta\" is commonly known as the Rice Seed Bug, a significant pest affecting rice crops in various regions.   \r\n• Physical Appearance:  Leptocorisa acuta is a brownish bug, typically measuring around 10-12 mm in length with a slender body and distinct antennae.\r\n• Habitat: They primarily infest rice fields, feeding on rice plants at various growth stages.",
  "prevention": "• Cultural Practices: Implement water management strategies like intermittent flooding or draining to disrupt their lifecycle.\r\n• Crop Rotation: Rotate rice crops with other non-host crops to reduce the buildup of bug populations.\r\n• Natural Predators: Encourage natural enemies like birds, spiders, and predatory insects that feed on rice seed bugs.",
  "pesticides": "1. Pyrethroids (e.g., deltamethrin, cypermethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the bugs or infested areas.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/deltamethrin.jpg",
    "pesticides/cypermethrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f888c9b0e3a20fdd61ad"
  },
  "name": "Sesamiya inferens",
  "p_image": "pest/10.jpg",
  "description": "\"Sesamia inferens,\" commonly known as the Pink Stem Borer, is a significant pest that affects maize, rice, and sorghum crops. \r\n• Physical Appearance: Sesamia inferens is a moth species. The adult moths have a wingspan of approximately 30-40 mm with brownish-grey forewings and lighter hindwings.\r\n• Life Cycle: They undergo complete metamorphosis, with egg, larval (caterpillar), pupal, and adult stages.",
  "prevention": "• Cultural Practices: Implement proper crop rotation, timely planting, and removal of crop residues to reduce overwintering sites.\r\n• Trap Crops: Plant trap crops to attract and divert moths away from main crops.\r\n• Biological Control: Encourage natural enemies like parasitic wasps, predatory insects, and birds that feed on moth eggs and larvae.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Organophosphates, Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/cypermethrin.jpg",
    "pesticides/deltamethrin.jpg",
    "pesticides/organophosphates.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f922c9b0e3a20fdd61ae"
  },
  "name": "Cicadella viridis",
  "p_image": "pest/11.jpg",
  "description": "\"Cicadella viridis\" refers to a species of leafhopper commonly known as the Green Leafhopper. These insects are small and are known to feed on plant sap, causing damage to various crops.  \r\n• Physical Appearance:Green Leafhoppers are small, slender insects typically around 3-4 mm in length. They are usually green or yellow-green in color.\r\n• Feeding Habits: They feed by piercing plant tissues and sucking out sap, potentially leading to yellowing of leaves and reduced plant vigor.\r\n• Damage: Feeding by leafhoppers can cause stippling on leaves, wilting, and even transmission of plant diseases in some cases.",
  "prevention": "• Cultural Practices: Maintain good plant health through proper irrigation, fertilization, and weed control to minimize stress on plants and reduce susceptibility to pests.\r\n• Habitat Management: Remove weed hosts and alternate plant hosts to deter leafhoppers from breeding and feeding.\r\n• Physical Barriers: Use fine mesh nets or row covers to physically block leafhoppers from reaching plants.",
  "pesticides": "1. Pyrethroids (e.g., Bifenthrin), Carbamates, Neonicotinoids:\r\n• Similar to natural pesticides, these are also applied as sprays directly onto the leafhoppers or infested areas.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but precise rates should be obtained from the product label.\r\n2. Neem Oil, Insecticidal Soaps, Pyrethrin-based Sprays:\r\n• These are usually applied as sprays directly onto the leafhoppers or infested plants.\r\n• Application rates may vary based on the concentration of the product and the targeted pest.\r\n• Rates could range from 1 to 5 milliliters per liter of water for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/bifenthrin.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f94ec9b0e3a20fdd61af"
  },
  "name": "Callitettix versicolor",
  "p_image": "pest/12.jpg",
  "description": "\"Callitettix versicolor\" refers to a genus of leafhoppers within the family Cicadellidae. Leafhoppers, in general, are small, wedge-shaped insects that commonly feed on plant sap. They can cause damage to plants by piercing and sucking on plant tissues, which may result in stunted growth, yellowing of leaves, or the transmission of plant diseases.",
  "prevention": "• Cultural Practices: Maintain plant health through proper watering, fertilization, and weed control to reduce plant stress, making them less susceptible to infestation.\r\n• Habitat Modification: Remove weeds and alternate plant hosts to deter leafhoppers from breeding and feeding.\r\n• Physical Barriers: Use fine mesh nets or row covers to physically block leafhoppers from reaching plants.\r\n• Natural Predators: Encourage natural enemies like parasitic wasps, predatory insects, and birds that feed on leafhoppers.",
  "pesticides": "1. Pyrethroids (e.g., Bifenthrin), Carbamates, Neonicotinoids:\r\n• Similar to natural pesticides, these are also applied as sprays directly onto the leafhoppers or infested areas.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but precise rates should be obtained from the product label.\r\n2. Neem Oil, Insecticidal Soaps, Pyrethrin-based Sprays:\r\n• These are typically applied as sprays directly onto the leafhoppers or infested plants.\r\n• Application rates may vary based on the concentration of the product and the targeted pest.\r\n• Rates might range from 1 to 5 milliliters per liter of water for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/bifenthrin.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f99dc9b0e3a20fdd61b0"
  },
  "name": "Scotinophara lurida",
  "p_image": "pest/13.jpg",
  "description": "\"Scotinophara lurida\" is a species of rice pest commonly known as the Rice Leaffolder. It's a significant pest in rice-growing regions, particularly in Asia. \r\n• Physical Appearance: The Rice Leaffolder is a caterpillar at its larval stage and a small moth at its adult stage.\r\n• Damage: In the larval stage, it folds and feeds on rice leaves, causing characteristic rolling of the leaves and affecting plant growth.",
  "prevention": "• Cultural Practices: Implement proper field hygiene, including the removal of crop residues, to reduce overwintering sites for pests.\r\n• Biological Control: Encourage natural predators like spiders, predatory insects, and birds that feed on the eggs and larvae of leaffolders.\r\n• Early Detection: Regularly inspect rice fields for signs of infestation, especially during susceptible plant growth stages.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\n2. Bacillus thuringiensis (Bt):\r\n• Application rates may also vary depending on the specific Bt product.\r\n• Rates are typically specified by the manufacturer and should be followed according to the label instructions.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/cypermethrin.jpg",
    "pesticides/deltamethrin.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561f9cec9b0e3a20fdd61b1"
  },
  "name": "Cletus punctiger",
  "p_image": "pest/14.jpg",
  "description": "\"Cletus punctiger\" is a species of stink bug known to infest various crops. Stink bugs, in general, are insects recognized by their distinctive shield-shaped bodies and foul odor they emit when threatened or crushed. They can cause damage to crops by piercing and sucking plant tissues.\r\n• Physical Appearance: Stink bugs like \"Cletus punctiger\" usually have shield-shaped bodies with various patterns and colors, but specific features might differ among species.\r\n• Feeding Habits: Stink bugs typically pierce plant tissues and feed on sap, which can cause wilting, discoloration, or deformities in crops.",
  "prevention": "• Habitat Management: Keep fields free of weeds, as they can serve as alternative hosts or breeding grounds for stink bugs.\r\n• Crop Rotation: Rotate crops to disrupt the lifecycle of stink bugs and reduce infestation risks.\r\n• Physical Barriers: Use physical barriers like row covers or netting to protect crops from stink bug infestations.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/cypermethrin.jpg",
    "pesticides/deltamethrin.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fa14c9b0e3a20fdd61b2"
  },
  "name": "Nezara viridula",
  "p_image": "pest/15.jpg",
  "description": "\"Nezara viridula\" is commonly known as the Southern Green Stink Bug or the Green Vegetable Bug. It's a major agricultural pest known for damaging various crops. \r\n• Physical Appearance: The Southern Green Stink Bug is shield-shaped, green in color, and ranges from 1.5 to 1.7 cm in length.\r\n• Habitat: They infest a wide range of crops including vegetables, fruits, and ornamentals. \r\n• Feeding Habits: They feed by piercing plant tissues and sucking out sap, causing direct damage to fruits, seeds, and young plant parts.\r\n• Impact: Infestation can result in distorted or blemished fruits, reduced yields, and economic losses.",
  "prevention": "• Cultural Practices: Maintain field hygiene by removing crop residues to minimize overwintering sites.\r\n• Crop Rotation: Rotate crops to disrupt the lifecycle of stink bugs and reduce infestation risks.\r\n• Habitat Modification: Manage weed populations as they can serve as alternative hosts or breeding grounds for stink bugs.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/cypermethrin.jpg",
    "pesticides/deltamethrin.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fa46c9b0e3a20fdd61b3"
  },
  "name": "Dicladispa armigera",
  "p_image": "pest/16.jpg",
  "description": "\"Dicladispa armigera\" is a type of beetle commonly known as the Rice Hispa. It's a significant pest in rice cultivation, particularly in Asia. \r\n• Physical Appearance: The Rice Hispa is a small, oval-shaped beetle, measuring about 2-4 mm in length. It has a shiny metallic blue-green or brownish coloration.\r\n• Feeding Habits: Both larvae and adults of this beetle feed on rice leaves, causing characteristic 'window-pane' damage by scraping the upper epidermis of leaves.\r\n• Impact:  Infestation leads to the appearance of translucent patches on leaves, affecting plant vigor and reducing yield.",
  "prevention": "• Cultural Practices: Maintain good field hygiene, such as proper irrigation, weed control, and the removal of crop residues to reduce overwintering sites for pests.\r\n• Early Planting: Timely planting can help to avoid the peak emergence of beetles.\r\n• Biological Control: Encourage natural enemies like predatory insects, parasitic wasps, and spiders that feed on beetle eggs and larvae.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/cypermethrin.jpg",
    "pesticides/deltamethrin.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fa83c9b0e3a20fdd61b4"
  },
  "name": "Riptortus pedestris",
  "p_image": "pest/17.jpg",
  "description": "\"Riptortus pedestris\" is commonly known as the Bean Bug or the Green Stink Bug. It's a significant agricultural pest that affects leguminous crops like soybeans. \r\n• Physical Appearance: The Green Stink Bug is shield-shaped, about 1.5 centimeters in length, and green in color.\r\n• Feeding Habits: Both nymphs and adults feed by piercing plant tissues and sucking sap from developing seeds and pods, causing damage.\r\n• Impact: Feeding results in seed damage, reduced yield, and quality loss in crops like soybeans.",
  "prevention": "• Cultural Practices: Implement good field hygiene, such as removing crop residues, to minimize overwintering sites for pests.\r\n• Crop Rotation: Rotate crops to disrupt the lifecycle of stink bugs and reduce infestation risks.\r\n• Habitat Modification: Manage weed populations as they can serve as alternative hosts or breeding grounds for stink bugs.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/cypermethrin.jpg",
    "pesticides/deltamethrin.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fac1c9b0e3a20fdd61b5"
  },
  "name": "Maruca testulalis",
  "p_image": "pest/18.jpg",
  "description": "\"Maruca testulalis,\" commonly known as the Maruca or the Legume Pod Borer, is a destructive pest that primarily affects leguminous crops like pigeon peas, cowpeas, and mung beans.  \r\n• Physical Appearance: The adult moth has a wingspan of around 2-3 centimeters with a characteristic pattern of brown and white markings.\r\n• Life Cycle: The larvae bore into pods and feed on seeds, causing damage during their feeding stages.\r\n• Feeding Habits: Larvae bore into pods, resulting in seed damage, reduced quality, and yield loss.\r\n• Impact: Infestation can lead to significant economic losses in legume crops.",
  "prevention": "• Cultural Practices: Implement field sanitation by removing crop residues to reduce overwintering sites for pests.\r\n• Crop Monitoring: Regularly inspect crops for signs of infestation, such as boreholes on pods.\r\n• Timely Harvest: Harvest mature crops promptly to reduce the chances of infestation.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/cypermethrin.jpg",
    "pesticides/deltamethrin.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fb00c9b0e3a20fdd61b6"
  },
  "name": "Chauliops fallax",
  "p_image": "pest/19.jpg",
  "description": "\"Chauliops fallax,\" is a stalk-eyed bug that is a major pest of bean plants, such as soybeans.  \r\n• Physical Appearance: Chauliops fallax is about 2.5 mm long in the adult stage. It has an oval, elongate body that narrows anteriorly and posteriorly. The body is also slightly constricted at the junction of the thorax and abdomen.",
  "prevention": " • The prevention of Chauliops fallax infestation involves monitoring and managing the pest in the early invasion stage1. This includes understanding the native evolutionary history, recent invasion history, and potential invasion threats of Chauliops fallax. Population genetic methods and ecological niche modelling are used for this purpose.",
  "pesticides": "1. Chlorpyriphos (0.02%)\r\n2. Monocrotophos (0.04%) \r\n3. Fenitrothion (0.05%)\r\n4. Cypermethrin (0.005%)\r\n5. Fenvalerate (0.05%) \r\n6. Dimethoate (0.03%)\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/chlorpyrifos.jpg",
    "pesticides/cypermethrin.jpg",
    "pesticides/fenvalerate.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fb28c9b0e3a20fdd61b7"
  },
  "name": "Chilo supperssalis",
  "p_image": "pest/20.jpg",
  "description": "\"Chilo suppressalis,\" is known as the Striped Stem Borer or Yellow Stem Borer, a significant pest in rice and other grass crops.   \r\n• Physical Appearance: The Striped Stem Borer is a slender, straw-colored moth with distinctive dark stripes on its wings.\r\n• Life Cycle: The larvae bore into the stems of rice plants, causing damage.\r\n• Feeding Habits: Larvae bore into the stems, leading to dead hearts and 'whiteheads,' affecting plant growth and yield.",
  "prevention": "• Cultural Practices: Implement field sanitation by removing crop residues to reduce overwintering sites for pests.\r\n• Crop Rotation: Rotate crops to disrupt the lifecycle of stem borers and reduce infestation risks.\r\n• Early Planting: Timely planting can help to avoid the peak emergence of borers.\r\n• Biological Control: Encourage natural enemies like parasitic wasps, predatory insects, and birds that feed on borer eggs and larvae.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\n2. Lambdacyhalothrin (4.9% CS)\r\n3. Chloropyriphos (50%) + Cypermethrin (5%)\r\n4. Cartap Hydrochloride (4% GR)\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/pyrethroids.jpg",
    "pesticides/chlorpyrifos.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fba6c9b0e3a20fdd61b8"
  },
  "name": "Stollia ventralis",
  "p_image": "pest/21.jpg",
  "description": "\"Stollia ventralis\", also commonly known as a type of plant bug or Eysarcoris ventralis, is a species of shield bugs belonging to the family Pentatomidae   \r\n• Physical Appearance: Physical Appearance: Eysarcoris ventralis is a type of plant bug known for its green coloration, measuring around 5-7 millimeters in length.\r\n• Feeding Habits: These bugs feed on plant juices and are known to affect various crops.\r\n• Feeding Behavior: They use their piercing mouthparts to extract sap from plants, which can lead to discoloration, wilting, or deformities in leaves and fruits.",
  "prevention": "• Cultural Practices: Implement good field hygiene by removing debris and weeds to reduce potential habitats for these bugs.\r\n• Natural Predators: Encourage natural enemies such as predatory insects, birds, or beneficial insects that feed on plant bugs.\r\n• Barriers and Traps: Consider using physical barriers or traps designed for plant bug control.",
  "pesticides": "1. Pyrethroids (e.g., cypermethrin, deltamethrin), Neonicotinoids:\r\n• These are often applied as sprays directly onto the affected areas or infested crops.\r\n• Application rates may vary based on the concentration of the product and the severity of the infestation.\r\n• Rates could range from 50 to 200 milliliters per hectare for spray applications, but specific rates will be specified on the product label.\r\nFollow the instructions and guidelines provided on the pesticide label strictly.\r\n• Timing: Apply pesticides during the early nymph stages or as soon as the infestation is observed for better control.\r\n• Method: Systemic insecticides are often applied to the soil around the base of trees or through trunk injection systems. Contact insecticides are sprayed directly on the insects or infested areas.\r\n• Safety Measures: Always read and follow the instructions and safety precautions provided on the pesticide label. Wear appropriate protective gear during handling and application.\r\nIntegrated Pest Management (IPM):\r\n• Comprehensive Approach: Combine pesticide use with other methods such as scraping egg masses, tree banding, and physical barriers for better management.\r\n• Regular Monitoring: Continuously monitor trees and areas for signs of infestation to take timely action.",
  "pest_image": [
    "pesticides/cypermethrin.jpg",
    "pesticides/pyrethroids.jpg",
    "pesticides/deltamethrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fbcfc9b0e3a20fdd61b9"
  },
  "name": "Nilaparvata lugens",
  "p_image": "pest/22.jpg",
  "description": "Nilaparvata lugens, commonly known as the brown planthopper, is a significant pest in rice cultivation across Asia.\r\n• Appearance: Adult brown planthoppers are around 3-4 mm in length, brownish in color with wings held roof-like over their bodies.\r\n• Life Cycle: They undergo incomplete metamorphosis—egg, nymph, and adult stages. Females lay eggs on the underside of leaves. Nymphs resemble adults but are smaller and lack wings.\r\n• Feeding Habits: They suck the sap from rice plants, causing damage by injecting toxins and reducing the plant's ability to photosynthesize.\r\n• Symptoms: Stunted growth, yellowing (called \"hopper burn\"), and in severe cases, plant death.",
  "prevention": "• Cultural Practices: Crop rotation, maintaining healthy soil, and proper water management.\r\n• Resistant Varieties: Planting resistant or tolerant rice varieties.\r\n• Biological Control: Encouraging natural enemies like spiders, dragonflies, and parasitic wasps.",
  "pesticides": "1. Imidacloprid\r\n2. Chlorpyrifos\r\n3. Fipronil\r\n4. Bifenthrin\r\n5. Parasitic Wasps: Certain parasitic wasps lay eggs in planthopper eggs, controlling their population naturally.\r\n6. Predatory Insects: Natural predators like spiders, ladybugs, and dragonflies feed on planthoppers, helping in their control.\r\n\r\n• Integrated Pest Management (IPM):\r\nIPM involves combining different pest control methods, including cultural, biological, and chemical approaches, to manage pests sustainably. It aims to minimize reliance on pesticides and focuses on long-term pest prevention.\r\n\r\n• Caution:\r\nResistant Management: Overuse of the same pesticides can lead to resistance in planthopper populations. It's crucial to rotate between different classes of pesticides and follow recommended application rates to prevent this.",
  "pest_image": [
    "pesticides/chlorpyrifos.jpg",
    "pesticides/bifenthrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fbf6c9b0e3a20fdd61ba"
  },
  "name": "Diostrombus politus",
  "p_image": "pest/23.jpg",
  "description": "Diostrombus politus is a species of hemipterans, or true bugs, that belongs to the family Alydidae. It is also known as the broad-headed bug or the cotton seed bug. It is found in tropical and subtropical regions of Asia, Africa, and Australia.\r\nDiostrombus politus is a pest of cotton and other crops, such as sorghum, millet, maize, and rice. It feeds on the seeds and bolls of cotton, reducing the yield and quality of the crop. It can also transmit diseases, such as bacterial blight and cotton leaf curl virus, to the plants.",
  "prevention": "• Cultural control involves crop rotation, intercropping, sanitation, and timely harvesting. \r\n• Mechanical control involves hand picking, trapping, and netting. \r\n• Biological control involves the use of natural enemies, such as parasitoids, predators, and pathogens.",
  "pesticides": "1. Organophosphates\r\n2. Pyrethroids\r\n3. Neonicotinoids\r\n\r\n• The application of pesticides for Diostrombus politus should be done with proper technique, equipment, and safety precautions. The pesticides should be applied at the right time, rate, and frequency, according to the label instructions and local regulations. The pesticides should be applied to the target area, avoiding drift and runoff. The pesticides should be handled, stored, and disposed of in a safe and responsible manner. \r\n• The applicators should wear protective clothing, gloves, and masks, and wash themselves and their equipment after use. The applicators should also monitor the pest population and the pesticide residues, and report any adverse effects to the authorities.",
  "pest_image": [
    "pesticides/organophosphates.jpg",
    "pesticides/pyrethroids.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fc24c9b0e3a20fdd61bb"
  },
  "name": "Phyllotreta striolata",
  "p_image": "pest/24.jpg",
  "description": "Phyllotreta striolata is a small flea beetle, shiny black with a greenish tinge, 1.5 to 2.5 mm long, having a wavy amber line running the length of each elytron (wing cover). It is a pest of cabbage and other brassicas, such as radish, turnip, mustard, cauliflower, and canola. It feeds on the seeds, roots, and leaves of these crops, reducing the yield and quality. It can also transmit diseases, such as bacterial blight and cotton leaf curl virus, to the plants.",
  "prevention": "• Cultural control involves crop rotation, intercropping, sanitation, and timely harvesting. \r\n• Mechanical control involves hand picking, trapping, and netting. \r\n• Biological control involves the use of natural enemies, such as parasitoids, predators, and pathogens. \r\n• Chemical control involves the use of pesticides, such as organophosphates, pyrethroids, and neonicotinoids.",
  "pesticides": "1. Carbaryl: A broad-spectrum carbamate insecticide that acts by inhibiting acetylcholinesterase, an enzyme that breaks down the neurotransmitter acetylcholine. Carbaryl can be applied as a foliar spray, dust, granule, or bait. It is effective against both adults and larvae of Phyllotreta striolata, but it is also toxic to beneficial insects, such as bees and ladybugs. Carbaryl has a low persistence in the environment, but it can contaminate water and soil.\r\n2. Imidacloprid: A systemic neonicotinoid insecticide that acts by binding to nicotinic acetylcholine receptors, causing overstimulation and paralysis of the insect nervous system. Imidacloprid can be applied as a seed treatment, soil drench, or foliar spray. It is effective against both adults and larvae of Phyllotreta striolata, but it is also toxic to pollinators, such as bees and butterflies. Imidacloprid has a moderate persistence in the environment, but it can leach into groundwater and surface water.\r\n3. Metarhizium anisopliae: A fungal entomopathogen that infects and kills insects by penetrating their cuticle and producing toxins and enzymes. Metarhizium anisopliae can be applied as a spore suspension, granule, or powder. It is effective against both adults and larvae of Phyllotreta striolata, but it is also pathogenic to some beneficial insects, such as predatory mites and beetles. Metarhizium anisopliae has a low persistence in the environment, but it can be affected by environmental factors, such as temperature, humidity, and sunlight.\r\n\r\n• The application of pesticides for Phyllotreta striolata should be done with proper technique, equipment, and safety precautions. The pesticides should be applied at the right time, rate, and frequency, according to the label instructions and local regulations. The pesticides should be applied to the target area, avoiding drift and runoff. The pesticides should be handled, stored, and disposed of in a safe and responsible manner. \r\n• The applicators should wear protective clothing, gloves, and masks, and wash themselves and their equipment after use. The applicators should also monitor the pest population and the pesticide residues, and report any adverse effects to the authorities.",
  "pest_image": [
    "pesticides/carbaryl.jpg",
    "pesticides/metarhizium-anisopliae.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fc47c9b0e3a20fdd61bc"
  },
  "name": "Aulacophora indica",
  "p_image": "pest/25.jpg",
  "description": "Aulacophora indica is a small leaf beetle that belongs to the family Chrysomelidae. It is also known as the cucurbit leaf beetle, the red cucurbit beetle, the pumpkin beetle, or the squash beetle. It is a pest of plants in the family Cucurbitaceae, such as cucumbers, pumpkins, melons, gourds, and squashes. It is found in tropical and subtropical regions of Asia, Africa, and Australia.\r\nThe description of Aulacophora indica is as follows:\r\n• It is 6 to 8 mm long and oval in shape.\r\n• It has a shiny black body with a greenish tinge.\r\n• It has a wavy amber line running along each wing cover (elytron).\r\n• It has black eyes and antennae.\r\n• It has yellow or black legs, depending on the population.",
  "prevention": "• Crop rotation: Planting different crops in the same field in different seasons or years to break the pest cycle.\r\n• Intercropping: Planting different crops together to reduce the pest infestation and increase the diversity of natural enemies.\r\n• Sanitation: Removing and destroying the infested plant parts and debris to reduce the pest population and breeding sites.\r\n• Timely harvesting: Harvesting the crops as soon as they are mature to avoid the damage by the pest.\r\n• Hand picking: Collecting and killing the adult beetles by hand or using a net or a trap.\r\n• Natural enemies: Encouraging or introducing the predators, parasitoids, or pathogens that can attack the pest, such as ladybugs, lacewings, spiders, wasps, nematodes, fungi, or bacteria.",
  "pesticides": "1. Carbaryl\r\n2. Imidacloprid\r\n3. Metarhizium anisopliae\r\nThe application of pesticides for Aulacophora indica should be done with proper technique, equipment, and safety precautions. Some of the guidelines are:\r\n• Follow the label instructions and local regulations for the pesticide use.\r\n• Apply the pesticide at the right time, rate, and frequency, depending on the pest stage and severity.\r\n• Apply the pesticide to the target area, avoiding drift and runoff to non-target areas.\r\n• Handle, store, and dispose of the pesticide in a safe and responsible manner, using protective clothing, gloves, and masks.\r\n• Wash yourself and your equipment after using the pesticide.\r\n• Monitor the pest population and the pesticide residues, and report any adverse effects to the authorities.",
  "pest_image": [
    "pesticides/carbaryl.jpg",
    "pesticides/metarhizium-anisopliae.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fc70c9b0e3a20fdd61bd"
  },
  "name": "Laodelphax striatellus",
  "p_image": "pest/26.jpg",
  "description": "Laodelphax striatellus is a species of true bug belonging to the family Delphacidae. It is also known as the small brown planthopper, the smaller brown planthopper, or the brown planthopper. It is a pest of rice and other cereal crops, such as wheat, maize, oats, and barley. It feeds on the plant sap and transmits several viral diseases, such as rice stripe virus and rice black-streaked dwarf virus, which can cause significant yield losses.\r\nThe description of Laodelphax striatellus is as follows:\r\n• Eggs: Eggs are white in color and laid in masses of 60-260 in the lower parts of the host plant, such as the midrib or the leaf sheath.\r\n• Nymphs: Nymphs have five instars and range from light to dark brown in color. The fifth instar has extended wing pads and dark-brown markings on the head.\r\n• Adults: Adults have two wing forms: macropterous (large-winged) and brachypterous (small-winged), which vary depending on environmental and genetic factors. The wings are transparent and the body, mesonotum, and pterostigma are black to dark-brown. The areas between the carinae of the frons are deep black, which is a distinctive feature of this species. The abdomen ranges from milky-white to black.",
  "prevention": "• Cultural control: This involves crop rotation, intercropping, sanitation, and timely harvesting to break the pest cycle and reduce the pest infestation.\r\n• Mechanical control: This involves hand picking, trapping, and netting to collect and kill the adult beetles.\r\n• Biological control: This involves the use of natural enemies, such as parasitoids, predators, and pathogens, that can attack the pest.",
  "pesticides": "1. Triflumezopyrim\r\n2. Carbaryl\r\n3. Imidacloprid\r\n4. Metarhizium anisopliae\r\n\r\nThe application of pesticides for Laodelphax striatellus should be done with proper technique, equipment, and safety precautions. Some of the guidelines are:\r\n• Follow the label instructions and local regulations for the pesticide use.\r\n• Apply the pesticide at the right time, rate, and frequency, depending on the pest stage and severity.\r\n• Apply the pesticide to the target area, avoiding drift and runoff to non-target areas.\r\n• Handle, store, and dispose of the pesticide in a safe and responsible manner, using protective clothing, gloves, and masks.\r\n• Wash yourself and your equipment after using the pesticide.\r\n• Monitor the pest population and the pesticide residues, and report any adverse effects to the authorities.",
  "pest_image": [
    "pesticides/carbaryl.jpg",
    "pesticides/metarhizium-anisopliae.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fc95c9b0e3a20fdd61be"
  },
  "name": "Ceroplastes ceriferus",
  "p_image": "pest/27.jpg",
  "description": "Ceroplastes ceriferus is a species of scale insect that belongs to the family Coccidae. It is also known as the Indian wax scale, and it is native to southern Asia. It has spread to many other parts of the world, where it is a pest of various plants, especially hollies and other evergreen shrubs.\r\nThe description of Ceroplastes ceriferus is as follows:\r\n• The adult female is immobile and covered by a thick layer of white or pinkish wax. It has a waxy horn pointing forward and waxy filaments around the margin, giving it a flower-like appearance. It is about 6 mm long and oval in shape. There are no males in this species.\r\n• The eggs are white and laid in masses under the wax cover of the female. They hatch into crawlers, which are mobile and rusty-red in color. They move to find a suitable feeding site on the plant.\r\n• The nymphs have five instars and are brown in color. They secrete wax and gradually lose their mobility and legs. The fifth instar has wing pads and dark markings on the head.",
  "prevention": "• Cultural control: This involves crop rotation, intercropping, sanitation, and timely harvesting to break the pest cycle and reduce the pest infestation.\r\n• Mechanical control: This involves hand picking, trapping, and netting to collect and kill the adult scales.\r\n• Biological control: This involves the use of natural enemies, such as parasitoids, predators, and pathogens, that can attack the scales.",
  "pesticides": "1. Carbaryl\r\n2. Imidacloprid\r\n3. Metarhizium anisopliae\r\nThe application of pesticides for Ceroplastes ceriferus should be done with proper technique, equipment, and safety precautions. Some of the guidelines are:\r\n• Follow the label instructions and local regulations for the pesticide use.\r\n• Apply the pesticide at the right time, rate, and frequency, depending on the pest stage and severity.\r\n• Apply the pesticide to the target area, avoiding drift and runoff to non-target areas.\r\n• Handle, store, and dispose of the pesticide in a safe and responsible manner, using protective clothing, gloves, and masks.\r\n• Wash yourself and your equipment after using the pesticide.\r\n• Monitor the pest population and the pesticide residues, and report any adverse effects to the authorities.",
  "pest_image": [
    "pesticides/carbaryl.jpg",
    "pesticides/metarhizium-anisopliae.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fcbcc9b0e3a20fdd61bf"
  },
  "name": "Corythucha marmorata",
  "p_image": "pest/28.jpg",
  "description": "Corythucha marmorata, also known as the chrysanthemum lace bug, is a species of lace bug in the family Tingidae. It is found in Central America and North America, and it feeds on plants in the family Asteraceae, such as chrysanthemums, sunflowers, and asters. It can cause damage to the leaves and flowers of these plants, reducing their ornamental value and vigor.\r\nThe description of Corythucha marmorata is as follows:\r\n• The adult is about 6 mm long and oval in shape. It has a shiny black body with a greenish tinge. It has a waxy horn pointing forward and waxy filaments around the margin, giving it a flower-like appearance. It has transparent wings with a wavy amber line running along each wing cover (elytron). It has black eyes and antennae. It has yellow or black legs, depending on the population.\r\n• The eggs are white and laid in masses under the wax cover of the female. They hatch into crawlers, which are mobile and rusty-red in color. They move to find a suitable feeding site on the plant.\r\n• The nymphs have five instars and are brown in color. They secrete wax and gradually lose their mobility and legs. The fifth instar has wing pads and dark markings on the head.",
  "prevention": "• Cultural control: This involves crop rotation, intercropping, sanitation, and timely harvesting to break the pest cycle and reduce the pest infestation.\r\n• Mechanical control: This involves hand picking, trapping, and netting to collect and kill the adult scales.\r\n• Biological control: This involves the use of natural enemies, such as parasitoids, predators, and pathogens, that can attack the scales.",
  "pesticides": "1. Carbaryl\r\n2. Imidacloprid\r\n3. Metarhizium anisopliae\r\nThe application of pesticides for Corythucha marmorata should be done with proper technique, equipment, and safety precautions. Some of the guidelines are:\r\n• Follow the label instructions and local regulations for the pesticide use.\r\n• Apply the pesticide at the right time, rate, and frequency, depending on the pest stage and severity.\r\n• Apply the pesticide to the target area, avoiding drift and runoff to non-target areas.\r\n• Handle, store, and dispose of the pesticide in a safe and responsible manner, using protective clothing, gloves, and masks.\r\n• Wash yourself and your equipment after using the pesticide.\r\n• Monitor the pest population and the pesticide residues, and report any adverse effects to the authorities.",
  "pest_image": [
    "pesticides/carbaryl.jpg",
    "pesticides/metarhizium-anisopliae.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fce2c9b0e3a20fdd61c0"
  },
  "name": "Dryocosmus kuriphilus",
  "p_image": "pest/29.jpg",
  "description": "Dryocosmus kuriphilus is a species of gall wasp that attacks chestnut trees and causes galls on their buds, leaves, and fruits. It is native to China, but it has been introduced to many other regions of the world, where it is considered an invasive pest. It can reduce the yield and quality of chestnut crops, and also increase the risk of fungal infections.\r\nThe description of Dryocosmus kuriphilus is as follows:\r\nThe adult female is about 2.5 to 3 mm long and shiny black in color with brown legs. It lays eggs in the buds of chestnut trees, sometimes producing over 100 eggs. It reproduces by parthenogenesis, without the need for males.\r\nThe eggs hatch into crawlers, which are mobile and rusty-red in color. They move to find a suitable feeding site on the plant.\r\nThe crawlers develop into nymphs, which have five instars and are brown in color. They secrete wax and gradually lose their mobility and legs. The fifth instar has wing pads and dark markings on the head.\r\nThe nymphs induce the formation of galls on the plant, which are green or pinkish and up to 2 cm wide. The galls protect the nymphs from predators and parasites. The nymphs emerge from the galls as adults in the summer. The galls dry out and become woody.",
  "prevention": "• Biological Control: Introducing natural predators or parasites that attack the gall wasp can help control populations.\r\n• Chemical Control: Pesticides are used to manage infestations. Insecticides are applied at specific times during the wasp's lifecycle to minimize damage. This method requires precise timing for effectiveness.\r\n• Cultural Control: Practices like pruning and removing galls during the dormant season can help reduce the population.\r\n• Resistant Varieties: Developing and planting chestnut varieties resistant to the gall wasp can mitigate infestation risks.",
  "pesticides": "1. Imidacloprid:\r\n• Type: Systemic insecticide\r\n• Application: Soil drench or injection into the soil around the tree base\r\n• Target Pest: Controls various sucking insects including some gall wasps\r\n• Timing: Applied during specific stages of the pest's lifecycle, usually in the spring\r\n2. Acetamiprid:\r\n• Type: Contact and systemic insecticide\r\n• Application: Foliar spray\r\n• Target Pest: Effective against a wide range of insects including gall-forming pests\r\n• Timing: Applied during the active stages of the pest, usually when new growth or buds are forming\r\n3. Bifenthrin:\r\n• Type: Synthetic pyrethroid insecticide\r\n• Application: Foliar spray or soil treatment\r\n• Target Pest: Controls a range of insects including gall-forming pests\r\n• Timing: Typically applied during the growing season when the pest is active\r\nImportant Considerations:\r\n• Timing of Application: Applying pesticides at the right stage of the pest's life cycle is critical for effectiveness.\r\n• Dosage: Follow manufacturer instructions for the correct amount of pesticide per unit area or per tree.\r\n• Environmental Impact: Consider the potential effects on beneficial insects, water sources, and non-target organisms.\r\n• Safety Precautions: Wear appropriate protective gear during handling and application, and follow safety guidelines strictly.",
  "pest_image": [
    "pesticides/acetamiprid.jpg",
    "pesticides/bifenthrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fd09c9b0e3a20fdd61c1"
  },
  "name": "Porthesia taiwana",
  "p_image": "pest/30.jpg",
  "description": "Porthesia taiwana is a species of moth that belongs to the family Erebidae. It is also known as the Taiwan yellow tussock moth or the chrysanthemum tussock moth. It is found in China, Japan, Korea, and Taiwan. It feeds on plants in the family Asteraceae, such as chrysanthemums, sunflowers, and asters. It can cause damage to the leaves and flowers of these plants, reducing their ornamental value and vigor.\r\nThe description of Porthesia taiwana is as follows:\r\n• The adult moth has a wingspan of 17 to 33 mm. The female is larger in size and has yellow or yellowish-brown forewings. A pair of grayish white horizontal stripes curve like an elbow and run parallel to each other in the center of the wings. The male is smaller and has white forewings with black spots. The hindwings are white with black margins. The body is covered with yellow hairs and has a black head and thorax.\r\n• The eggs are white and laid in masses of 100 to 300 on the underside of the host plant leaves. They hatch into caterpillars, which are yellowish-green with black spots and long hairs. They feed on the leaves and flowers of the host plant and can cause defoliation and flower damage.\r\n• The caterpillars pupate in cocoons made of silk and hairs. The cocoons are attached to the host plant or nearby objects. The pupae are dark brown and have yellow hairs. The adult moths emerge from the cocoons after about two weeks.",
  "prevention": "• Biological Control: Introducing natural predators, such as certain parasitic wasps or predators that feed on caterpillars, can help manage populations.\r\n• Cultural Control: Practices like pruning affected areas or removing egg masses can help reduce populations.\r\n• Chemical Control: Insecticides are used to manage infestations. However, the use of pesticides requires careful consideration and adherence to safety guidelines and environmental regulations.",
  "pesticides": "1. Bacillus thuringiensis (Bt):\r\n• Type: Biological insecticide\r\n• Application: Foliar spray\r\n• Target Pest: Effective against various caterpillar pests by causing stomach poisoning in larvae.\r\n• Usage: Apply during the early larval stages for better efficacy.\r\n2. Insecticidal Soaps:\r\n• Type: Contact insecticide\r\n• Application: Foliar spray\r\n• Target Pest: Effective against soft-bodied insects like caterpillars by disrupting their cell membranes.\r\n• Usage: Apply directly to the larvae, targeting the undersides of leaves.\r\n3. Pyrethroid Insecticides (e.g., Permethrin, Cypermethrin):\r\n• Type: Synthetic insecticide\r\n• Application: Foliar spray or trunk injection\r\n• Target Pest: Broad-spectrum insecticides effective against many pests, including caterpillars.\r\n• Usage: Apply according to label instructions, considering the pest's life cycle and growth stage.\r\nImportant Considerations:\r\n• Pesticide Selection: Choose pesticides labeled for caterpillar or lepidopteran pests, following recommendations specifically for tree and ornamental pests where applicable.\r\n• Dosage and Timing: Follow manufacturer instructions for proper dosage and application timings. Timing is crucial for effectiveness against caterpillars.\r\n• Environmental Impact: Consider the environmental impact and potential harm to beneficial insects. Minimize pesticide use when possible.\r\n• Safety Precautions: Always wear protective gear and adhere strictly to safety guidelines provided by the pesticide manufacturer.",
  "pest_image": [
    "pesticides/pyrethroids.jpg",
    "pesticides/cypermethrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fd2fc9b0e3a20fdd61c2"
  },
  "name": "Chromatomyia horticola",
  "p_image": "pest/31.jpg",
  "description": "Chromatomyia horticola is a species of leaf-mining fly that belongs to the family Agromyzidae. It is also known as the garden pea leafminer, and it is a pest of various plants, especially peas, chrysanthemums, and sunflowers. It feeds on the leaves and buds of these plants, creating mines that reduce the photosynthesis and growth of the plants. It can also transmit viral diseases, such as pea enation mosaic virus and chrysanthemum stunt viroid, to the plants.\r\nThe description of Chromatomyia horticola is as follows:\r\n• The adult fly is about 2 to 3 mm long and shiny black in color with yellow markings on the head and thorax. It has transparent wings with a wavy amber line running along each wing cover (elytron). It has black eyes and antennae. It has yellow or black legs, depending on the population.\r\n• The eggs are white and laid in masses of 20 to 50 on the underside of the host plant leaves. They hatch into larvae, which are yellowish-green with black spots and long hairs. They feed on the leaf tissue and create mines that are initially narrow and linear, but later become wider and blotchy.\r\n• The larvae pupate in brown puparia within the mines or on the soil surface. The pupae are dark brown and have yellow hairs. The adult flies emerge from the pupae after about two weeks.",
  "prevention": "• Cultural Control: Remove and destroy affected leaves or plants. Maintain good garden hygiene by clearing plant debris where the pests might overwinter.\r\n• Biological Control: Encourage natural predators like parasitic wasps or predatory insects that feed on leaf miners.\r\n• Chemical Control: Insecticides can be used as a part of an integrated pest management (IPM) approach.",
  "pesticides": "1. Spinosad:\r\n• Type: Biopesticide derived from a naturally occurring soil bacterium\r\n• Application: Foliar spray\r\n• Target Pest: Effective against various leaf miners and caterpillar pests\r\n• Usage: Apply when leaf miner larvae are actively feeding\r\n2. Abamectin:\r\n• Type: Systemic insecticide derived from soil bacteria\r\n• Application: Foliar spray\r\n• Target Pest: Effective against leaf miners and mites\r\n• Usage: Apply during the larval stage of leaf miners for better efficacy\r\n3. Imidacloprid:\r\n• Type: Systemic insecticide\r\n• Application: Soil drench or foliar spray\r\n• Target Pest: Broad-spectrum insecticide effective against various pests including leaf miners\r\n• Usage: Apply when leaf miner larvae are active, considering the crop's growth stage\r\nImportant Considerations:\r\n• Dosage and Timing: Follow the manufacturer's recommendations for proper dosage and application timings. Apply during the susceptible stages of the leaf miner's life cycle.\r\n• Application Method: Ensure thorough coverage of the affected plants, especially the undersides of leaves where the leaf miner larvae reside.\r\n• Environmental Impact: Consider the potential environmental impact and the presence of beneficial insects. Minimize pesticide use when possible.\r\n• Safety Precautions: Always wear appropriate protective gear during handling and application, following safety guidelines provided by the pesticide manufacturer.\r\n\r\n• Integrated Pest Management (IPM):\r\nIt's essential to combine chemical treatments with other control methods, such as cultural practices and biological controls, for a more holistic approach to managing leaf miner infestations.",
  "pest_image": [
    "pesticides/spinosad.jpg",
    "pesticides/abamectin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fd54c9b0e3a20fdd61c3"
  },
  "name": "Iscadia inexacta",
  "p_image": "pest/32.jpg",
  "description": "Iscadia inexacta is a moth of the family Nolidae, first described by Francis Walker in 1858. It is found in northern India, Myanmar, and Borneo, as well as in Queensland and New South Wales in Australia.\r\nThe description of Iscadia inexacta is as follows:\r\n• The adult moth has patchy brown forewings, each with two dark marks on the costa. The hindwings are brown, darkening toward the margins. • The moth has very hairy legs.\r\n• The eggs are white and laid in masses under the wax cover of the female. They hatch into caterpillars, which are yellowish-green with black spots and long hairs. They feed on the leaves and flowers of various Euphorbiaceae species, such as Omalanthus populifolius, Sapium discolor, and Triadica sebifera.\r\n• The caterpillars pupate in cocoons made of silk and hairs. The cocoons are attached to the host plant or nearby objects. The pupae are dark brown and have yellow hairs. The adult moths emerge from the cocoons after about two weeks.",
  "prevention": "• Cultural Practices: Implement good orchard hygiene by removing fallen fruits promptly and disposing of infested fruits properly. This helps reduce the population's spread.\r\n• Monitoring: Regularly check crops for signs of infestation such as entry holes, larvae, or damaged fruits.\r\n• Biological Control: Some natural enemies like parasitic wasps can be used as biological control agents to manage guava moth populations.\r\n• Pheromone Traps: These traps can help monitor and control the population by attracting and trapping adult male moths.",
  "pesticides": "1. Methoxyfenozide: This IGR disrupts the molting process of the larvae, preventing them from reaching maturity.\r\n2. Tebufenozide: Similar to methoxyfenozide, it interferes with the larvae's growth and development.\r\n3. Bacillus thuringiensis (Bt): Bacillus thuringiensis var. kurstaki (Btk): This bacterial pesticide specifically targets moth and butterfly larvae, including guava moth caterpillars, without harming beneficial insects.\r\n4. Synthetic Pyrethroids:\r\n• Bifenthrin: A broad-spectrum insecticide effective against various pests, including adult moths.\r\n• Cypermethrin: Known for its contact action against adult insects, it can be used to target guava moth adults.\r\n\r\nApplication:\r\n• Timing: Apply pesticides during the susceptible stages of the guava moth's life cycle.\r\n• Method: Follow the application instructions provided on the pesticide label, which might include spraying on foliage, fruits, or soil, depending on the targeted stage.\r\n• Dosage: Dilute concentrated pesticides according to the label instructions and apply the recommended amount per unit area.\r\nSafety Precautions:\r\n• Protective Gear: Wear appropriate protective clothing, goggles, gloves, and masks when handling pesticides.\r\n• Environmental Concerns: Consider the impact on non-target organisms and the environment; follow recommended practices to minimize harm.",
  "pest_image": [
    "pesticides/methoxyfenozide.jpg",
    "pesticides/bifenthrin.jpg",
    "pesticides/cypermethrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fd76c9b0e3a20fdd61c4"
  },
  "name": "Plutella xylostella",
  "p_image": "pest/33.jpg",
  "description": "Plutella xylostella, also known as the diamondback moth or the cabbage moth, is a small, grayish-brown moth that belongs to the family Plutellidae. It is a pest of cruciferous crops, such as cabbage, cauliflower, broccoli, and kale. It feeds on the leaves and buds of these plants, creating holes and mines that reduce the photosynthesis and growth of the plants. It can also transmit viral diseases, such as rice stripe virus and rice black-streaked dwarf virus, to the plants.\r\n• Appearance: The adult diamondback moth has a wingspan of about 15-20 mm with distinctive diamond-shaped markings on its wings. Larvae are green caterpillars with a pointed head and feed on plant foliage.\r\n• Life Cycle: The life cycle includes egg, larval, pupal, and adult stages. The females lay eggs on the undersides of leaves. Upon hatching, the larvae feed voraciously on the foliage.",
  "prevention": "• Cultural Practices: Crop rotation, removing crop residues, and practicing good field hygiene can disrupt the moth's life cycle.\r\n• Biological Control: Natural enemies such as parasitic wasps and predatory insects can help manage populations.\r\n• Pheromone Traps: These traps help monitor adult populations and might aid in reducing mating success.",
  "pesticides": "1. Bacillus thuringiensis (Bt): Various strains of Bt, such as Bacillus thuringiensis var. kurstaki (Btk), are effective against diamondback moth larvae. Bt produces proteins that are toxic to certain insect larvae upon ingestion.\r\n2. Spinosad: Derived from naturally occurring soil bacteria, Spinosad targets the nervous system of insects, including diamondback moth larvae, causing paralysis and death.\r\n3. Cypermethrin: A synthetic pyrethroid that acts on the nervous system of insects, effective against adult diamondback moths.\r\n4. Permethrin: Similar to cypermethrin, it's a broad-spectrum insecticide used against various pests, including adult diamondback moths.\r\n5. Methoxyfenozide: An IGR that interferes with the growth and development of moth larvae by disrupting their molting process.\r\nApplication:\r\n• Timing: Apply pesticides at the appropriate stage of the diamondback moth's life cycle for maximum efficacy. This often involves targeting the larvae.\r\n• Method: Follow the instructions on the pesticide label for the specific crop and pest. Application methods may include spraying directly onto foliage.\r\n• Dosage: Dilute concentrated pesticides according to label instructions and apply the recommended amount per unit area.\r\nSafety Precautions:\r\n• Protective Gear: Wear appropriate protective clothing, goggles, gloves, and masks when handling pesticides.\r\n• Environmental Concerns: Consider the impact on non-target organisms and the environment. Follow recommended practices to minimize harm.\r\nResistance Management:\r\nTo prevent the development of resistance in moth populations, rotate pesticides and use them judiciously.",
  "pest_image": [
    "pesticides/methoxyfenozide.jpg",
    "pesticides/spinosad.jpg",
    "pesticides/cypermethrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fd9cc9b0e3a20fdd61c5"
  },
  "name": "Empoasca flavescens",
  "p_image": "pest/34.jpg",
  "description": "Empoasca flavescens is a species of true bug in the family Cicadellidae. It is a pest of millets such as sorghum in Asia1 It feeds on the plant sap and causes yellowing, curling, and wilting of the leaves. It can also transmit viral diseases, such as rice stripe virus and rice black-streaked dwarf virus, to the plants.\r\n• Appearance: Green leafhoppers are small, about 3-4 mm in length, with greenish-yellow bodies and transparent wings.\r\n• Feeding Behavior: They feed by piercing plant tissues and sucking out sap, causing damage to leaves and reducing plant vigor.\r\n• Life Cycle: Green leafhoppers undergo incomplete metamorphosis, progressing through egg, nymph, and adult stages. They reproduce rapidly under favorable conditions.",
  "prevention": "• Cultural Practices: Crop rotation, removal of weed hosts, and maintaining good field hygiene can help reduce leafhopper populations.\r\n• Physical Barriers: Use of physical barriers like row covers or mesh netting can prevent leafhoppers from accessing plants.\r\n• Companion Planting: Some plants act as repellents or attract natural predators of leafhoppers, aiding in pest control.\r\n• Predatory Insects: Encouraging the presence of natural enemies such as ladybugs, lacewings, and parasitic wasps can help keep leafhopper populations in check.",
  "pesticides": "1. Imidacloprid: A systemic insecticide that disrupts the nervous system of leafhoppers. It's commonly used to control a wide range of sucking pests.\r\n2. Cypermethrin: This contact insecticide affects the nervous system of leafhoppers, leading to their elimination.\r\n3. Bifenthrin: Another synthetic pyrethroid effective against leafhoppers and various other pests.\r\n4. Neem Oil: Derived from the neem tree, neem oil acts as a repellent and disrupts the feeding and growth of leafhoppers and other sucking pests.\r\nApplication:\r\n• Timing: Apply pesticides when leafhopper populations are actively feeding or during vulnerable stages, such as nymphal stages.\r\n• Method: Follow the instructions on the pesticide label for the specific crop and pest. Application methods may include spraying directly onto foliage or using systemic treatments.\r\n• Dosage: Dilute concentrated pesticides according to label instructions and apply the recommended amount per unit area.\r\nSafety Precautions:\r\n• Protective Gear: Wear appropriate protective clothing, goggles, gloves, and masks when handling pesticides.\r\n• Environmental Concerns: Consider the impact on non-target organisms and the environment. Follow recommended practices to minimize harm.\r\n• Integrated Pest Management (IPM):\r\nCombine pesticide use with other control methods, such as cultural practices and biological control, for effective management while reducing reliance solely on pesticides.",
  "pest_image": [
    "pesticides/bifenthrin.jpg",
    "pesticides/cypermethrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fdc5c9b0e3a20fdd61c6"
  },
  "name": "Dolerus tritici",
  "p_image": "pest/35.jpg",
  "description": "Dolerus tritici is a species of sawfly that belongs to the family Tenthredinidae. It is a pest of wheat and other cereals in China and some parts of Europe. It feeds on the leaves of the host plants, creating holes and mines that reduce the photosynthesis and growth of the plants. It can also transmit viral diseases, such as rice stripe virus and rice black-streaked dwarf virus, to the plants.\r\nThe description of Dolerus tritici is as follows:\r\n• The adult sawfly is about 6 to 8 mm long and oval in shape. It has a shiny black body with a greenish tinge. It has a wavy amber line running along each wing cover (elytron). It has black eyes and antennae. It has yellow or black legs, depending on the population.\r\n• The eggs are white and laid in masses of 60 to 260 in the lower parts of the host plant, such as the midrib or the leaf sheath.\r\n• The larvae are yellowish-green with black spots and long hairs. They feed on the leaf tissue and create mines that are initially narrow and linear, but later become wider and blotchy.\r\n• The pupae are dark brown and have yellow hairs. They are enclosed in cocoons made of silk and hairs. The cocoons are attached to the host plant or nearby objects. The adult sawflies emerge from the cocoons after about two weeks.",
  "prevention": "• Cultural Practices: Crop rotation, destroying crop residues after harvest, and delayed planting can help disrupt the life cycle of the wheat stem sawfly.\r\n• Varietal Resistance: Some wheat varieties show resistance or tolerance to wheat stem sawfly damage.\r\n• Early Detection: Regular field monitoring for sawfly activity and stem damage can help implement timely control measures.\r\n• Parasitic Wasps: Encouraging the presence of parasitic wasps that prey on wheat stem sawfly larvae can aid in population control.",
  "pesticides": "1. Imidacloprid:\r\nApplication Method: Imidacloprid can be applied as a seed treatment or as a soil drench to provide systemic protection to the growing wheat plant against various pests. However, its efficacy against wheat stem sawflies may be limited due to the pest's behavior of feeding inside the stems.\r\n• Cultural Practices: Implementing crop rotation, destroying crop residues, and delayed planting can disrupt the life cycle of wheat stem sawflies.\r\n• Biological Control: Encouraging natural enemies such as parasitic wasps that prey on sawfly larvae can help manage populations.\r\n• Varietal Resistance: Some wheat varieties exhibit resistance or tolerance to wheat stem sawfly damage, which can be a useful preventive measure.\r\nLimitations and Recommendations:\r\n• Effectiveness: Pesticides, including systemic insecticides, might not provide complete control of wheat stem sawflies due to their protected feeding behavior inside the stems.\r\n• Integrated Pest Management (IPM): Combining various control methods, such as cultural practices, biological control, and varietal resistance alongside limited pesticide use, forms a more effective approach to manage this pest.",
  "pest_image": []
},
{
  "_id": {
    "$oid": "6561fde8c9b0e3a20fdd61c7"
  },
  "name": "Spodoptera litura",
  "p_image": "pest/36.jpg",
  "description": "Spodoptera litura is a nocturnal moth that belongs to the family Noctuidae. It is also known as the tobacco cutworm or the cotton leafworm. It is a serious pest of various crops, especially in Asia, Oceania, and the Indian subcontinent. It feeds on the leaves and buds of the host plants, creating holes and mines that reduce the photosynthesis and growth of the plants. It can also transmit viral diseases, such as rice stripe virus and rice black-streaked dwarf virus, to the plants.\r\nThe description of Spodoptera litura is as follows:\r\n• The adult moth has a wingspan of 30 to 38 mm (1.18 to 1.5 inches). The forewings are gray to reddish-brown, with a complex pattern of creamy streaks and paler lines along the veins. The hindwings are grayish-white with grayish-brown margins. The male has a blue-grey band from the upper corner (apex) to the inner margin of each forewing. The female is larger and has a more pronounced orbicular spot on the forewing.\r\n• The eggs are white and laid in masses of 60 to 260 on the lower parts of the host plant, such as the midrib or the leaf sheath. They hatch into larvae, which are yellowish-green with black spots and long hairs. They feed on the leaf tissue and create mines that are initially narrow and linear, but later become wider and blotchy.\r\n• The larvae pupate in brown puparia within the mines or on the soil surface. The pupae are dark brown and have yellow hairs. The adult moths emerge from the pupae after about two weeks.",
  "prevention": "• Cultural Practices: Crop rotation, removal of crop residues, and maintaining field hygiene can help disrupt the life cycle of Spodoptera litura.\r\n• Physical Barriers: Using row covers or mesh netting can prevent adult moths from laying eggs on plants.\r\n• Early Detection: Regular scouting and monitoring for signs of infestation, such as feeding damage or the presence of eggs or larvae, can aid in early intervention.\r\n• Predatory Insects: Encouraging natural enemies like parasitic wasps, predatory beetles, and spiders can help control the population of tobacco cutworms.",
  "pesticides": "1. Bifenthrin: A synthetic pyrethroid effective against a wide range of caterpillars, including Spodoptera litura.\r\n2. Cypermethrin: Another pyrethroid that targets various insect pests, including tobacco cutworms.\r\n3. Chlorpyrifos: Effective against caterpillars, it's used in some regions for controlling Spodoptera litura.\r\n4. Bacillus thuringiensis (Bt): Certain strains of Bt, like Bacillus thuringiensis var. kurstaki (Btk), are effective against caterpillars like Spodoptera litura while being less harmful to beneficial insects.\r\nApplication:\r\n• Life Cycle Stage: Timing of application is crucial. Some pesticides might be more effective against young larvae, while others could target older larvae or adults. Consider the life stage most susceptible to the chosen pesticide.\r\n• Crop Specificity: Some crops might have specific recommendations or tolerances for certain pesticides. Always check if the pesticide is labeled for use on the particular crop you're treating.\r\n• Environmental Impact: Consider the environmental impact and potential harm to non-target organisms before and during pesticide application.\r\nSafety Precautions:\r\n• Protective Gear: Use appropriate protective clothing, goggles, gloves, and masks when handling pesticides.\r\n• Environmental Concerns: Consider the impact on non-target organisms and the environment. Follow recommended practices to minimize harm.",
  "pest_image": [
    "pesticides/chlorpyrifos.jpg",
    "pesticides/bifenthrin.jpg",
    "pesticides/cypermethrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fe1fc9b0e3a20fdd61c8"
  },
  "name": "Corythucha ciliata",
  "p_image": "pest/37.jpg",
  "description": "Corythucha ciliata is a species of lace bug that is associated with sycamore trees. It is native to North America, but has been introduced and has spread in Europe. It is a small, whitish insect and feeds on the underside of the leaves, sucking sap.\r\nThe description of Corythucha ciliata is as follows:\r\n• The adult is about 3.2 to 3.7 mm long and oval in shape. It has a shiny black body with a greenish tinge. It has transparent wings with a wavy amber line running along each wing cover (elytron). It has black eyes and antennae. It has yellow or black legs, depending on the population.\r\n• The eggs are white and laid in masses under the wax cover of the female. They hatch into crawlers, which are mobile and rusty-red in color. They move to find a suitable feeding site on the plant.\r\n• The nymphs have five instars and are brown in color. They secrete wax and gradually lose their mobility and legs. The fifth instar has wing pads and dark markings on the head.",
  "prevention": "• Cultural Control: Maintain overall tree health through proper watering, fertilization, and pruning. Healthy trees are more resistant to pests.\r\n• Physical Control: Prune and remove heavily infested leaves or branches and dispose of them properly.\r\n• Biological Control: Encourage natural predators like ladybugs, lacewing larvae, and predatory wasps that feed on lace bugs.\r\n• Chemical Control: Insecticides are used for severe infestations.",
  "pesticides": "1. Insecticidal Soaps:\r\n• Type: Contact insecticide\r\n• Application: Foliar spray\r\n• Target Pest: Effective against soft-bodied insects like lace bugs by suffocating them.\r\n• Usage: Apply directly to the undersides of leaves where lace bugs are feeding.\r\n2. Neem Oil:\r\n• Type: Botanical insecticide\r\n• Application: Foliar spray\r\n• Target Pest: Acts as a repellent, growth regulator, and feeding deterrent against lace bugs.\r\n• Usage: Apply as directed, ensuring thorough coverage of infested leaves.\r\n3. Pyrethroid Insecticides (e.g., Bifenthrin):\r\n• Type: Synthetic insecticide\r\nvApplication: Foliar spray\r\nvTarget Pest: Broad-spectrum insecticide effective against many pests including lace bugs.\r\nvUsage: Apply during the active feeding period of lace bugs, targeting the undersides of leaves.\r\nImportant Considerations:\r\n• Dosage and Timing: Follow the manufacturer's recommendations for proper dosage and application timings. Apply during the susceptible stages of the lace bug's life cycle.\r\n• Application Method: Ensure thorough coverage of the affected plants, especially the undersides of leaves where the lace bugs typically reside.\r\n• Environmental Impact: Consider the potential environmental impact and the presence of beneficial insects. Minimize pesticide use when possible.\r\n• Safety Precautions: Always wear appropriate protective gear during handling and application, following safety guidelines provided by the pesticide manufacturer.\r\n• Integrated Pest Management (IPM):\r\nIt's essential to combine chemical treatments with other control methods, such as cultural practices and biological controls, for a more holistic approach to managing lace bug infestations.",
  "pest_image": [
    "pesticides/bifenthrin.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fe48c9b0e3a20fdd61c9"
  },
  "name": "Bemisia tabaci",
  "p_image": "pest/38.jpg",
  "description": "Bemisia tabaci, also known as the sweet potato whitefly or the cotton leafworm, is a small, grayish-brown moth that belongs to the family Plutellidae. It is a pest of various crops, especially in tropical, subtropical, and temperate regions. It feeds on the plant sap and causes yellowing, curling, and wilting of the leaves. It can also transmit viral diseases, such as rice stripe virus and rice black-streaked dwarf virus, to the plants.\r\nThe description of Bemisia tabaci is as follows:\r\n• The adult moth has a wingspan of 30 to 38 mm (1.18 to 1.5 inches). The forewings are gray to reddish-brown, with a complex pattern of creamy streaks and paler lines along the veins. The hindwings are grayish-white with grayish-brown margins. The male has a blue-grey band from the upper corner (apex) to the inner margin of each forewing. The female is larger and has a more pronounced orbicular spot on the forewing.\r\n• The eggs are white and laid in masses of 60 to 260 on the lower parts of the host plant, such as the midrib or the leaf sheath. They hatch into larvae, which are yellowish-green with black spots and long hairs. They feed on the leaf tissue and create mines that are initially narrow and linear, but later become wider and blotchy.\r\n• The larvae pupate in brown puparia within the mines or on the soil surface. The pupae are dark brown and have yellow hairs. The adult moths emerge from the pupae after about two weeks.",
  "prevention": "• Cultural control: This involves crop rotation, intercropping, sanitation, and timely harvesting to break the pest cycle and reduce the pest infestation.\r\n• Mechanical control: This involves hand picking, trapping, and netting to collect and kill the adult moths and larvae.\r\n• Biological control: This involves the use of natural enemies, such as parasitoids, predators, and pathogens, that can attack the moths and larvae. For example, wasps, flies, beetles, spiders, birds, bats, fungi, and bacteria.\r\n• Chemical control: This involves the use of pesticides, such as carbaryl, imidacloprid, or metarhizium anisopliae, that can kill the moths and larvae.",
  "pesticides": "1. Neonicotinoids (e.g., Imidacloprid):\r\n• Type: Systemic insecticide\r\n• Application: Soil drench or foliar spray\r\n• Target Pest: Effective against whiteflies and other sucking insects by disrupting their nervous system.\r\n• Usage: Apply as a soil drench or foliar spray, targeting the undersides of leaves where whiteflies typically feed.\r\n2. Pyrethroid Insecticides (e.g., Bifenthrin):\r\n• Type: Synthetic insecticide\r\n• Application: Foliar spray\r\n• Target Pest: Broad-spectrum insecticide effective against many pests including whiteflies.\r\n• Usage: Apply during the active feeding period of whiteflies, ensuring thorough coverage of infested plants.\r\n3. Insect Growth Regulators (IGRs) (e.g., Pyriproxyfen):\r\n• Type: Hormone mimic or growth regulator\r\n• Application: Foliar spray or soil drench\r\n• Target Pest: Disrupts the development of immature whiteflies.\r\n• Usage: Apply during early stages of whitefly infestation for better efficacy.\r\nImportant Considerations:\r\n• Dosage and Timing: Follow the manufacturer's recommendations for proper dosage and application timings. Apply during the susceptible stages of the whitefly's life cycle.\r\n• Application Method: Ensure thorough coverage of the affected plants, especially the undersides of leaves where the whiteflies usually reside.\r\n• Environmental Impact: Consider the potential environmental impact and the presence of beneficial insects. Minimize pesticide use when possible.\r\n• Safety Precautions: Always wear appropriate protective gear during handling and application, following safety guidelines provided by the pesticide manufacturer.\r\n• Integrated Pest Management (IPM):\r\nIt's crucial to combine chemical treatments with other control methods, such as cultural practices and biological controls, for a more holistic approach to managing whitefly infestations.",
  "pest_image": [
    "pesticides/bifenthrin.jpg",
    "pesticides/pyriproxyfen.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fe74c9b0e3a20fdd61ca"
  },
  "name": "Ceutorhynchus asper",
  "p_image": "pest/39.jpg",
  "description": "Ceutorhynchus asper is a species of weevil that belongs to the family Curculionidae. It is also known as the rapeseed stem weevil or the cabbage stem weevil. It is a pest of cruciferous crops, such as rapeseed, cabbage, and mustard. It feeds on the stems and roots of these plants, creating tunnels and galls that reduce the plant vigor and yield. It can also transmit fungal diseases, such as Phoma lingam and Leptosphaeria maculans, to the plants.\r\nThe description of Ceutorhynchus asper is as follows:\r\nThe adult weevil is about 3 to 4 mm long and oval in shape. It has a shiny black body with a greenish tinge. It has a long and curved snout with antennae at the base. It has transparent wings with a wavy amber line running along each wing cover (elytron). It has black eyes and legs.\r\nThe eggs are white and laid in masses of 20 to 50 on the lower parts of the host plant, such as the midrib or the leaf sheath. They hatch into larvae, which are yellowish-white with brown heads and no legs. They feed on the stem and root tissue and create tunnels and galls that are initially narrow and linear, but later become wider and blotchy.\r\nThe larvae pupate in brown puparia within the tunnels or galls. The pupae are dark brown and have yellow hairs. The adult weevils emerge from the pupae after about two weeks.",
  "prevention": "• Cultural Control: Crop rotation can help disrupt the pest's life cycle by preventing the buildup of populations in specific fields.\r\n• Physical Control: Removing and destroying infested plant debris and weeds can reduce overwintering sites and populations.\r\n• Biological Control: Natural enemies like parasitic wasps or predatory insects that target cabbage seed weevils can aid in population control.\r\n• Chemical Control: Insecticides are used for severe infestations.",
  "pesticides": "1. Pyrethroids (e.g., Lambda-cyhalothrin):\r\n• Type: Synthetic insecticide\r\n• Application: Foliar spray or soil treatment\r\n• Target Pest: Effective against various beetles, including cabbage seed weevils.\r\n• Usage: Apply when adult weevils are active or during the early stages of infestation.\r\n2. Neonicotinoids (e.g., Thiamethoxam):\r\n• Type: Systemic insecticide\r\n• Application: Seed treatment, soil drench, or foliar spray\r\n• Target Pest: Affects the nervous system of insects including weevils.\r\n• Usage: Apply as a seed treatment or soil application to protect young plants from early infestation.\r\n3. Organophosphates (e.g., Chlorpyrifos):\r\n• Type: Contact insecticide\r\n• Application: Foliar spray\r\n• Target Pest: Effective against a range of insects, including weevils.\r\n• Usage: Apply during the adult weevil's active feeding period, targeting infested plants.\r\nImportant Considerations:\r\n• Dosage and Timing: Follow the manufacturer's recommendations for proper dosage and application timings. Apply during the susceptible stages of the weevil's life cycle.\r\n• Application Method: Ensure thorough coverage of the affected plants, targeting the areas where weevils lay eggs or feed.\r\n• Environmental Impact: Consider the potential environmental impact and risks to non-target organisms. Minimize pesticide use when possible.\r\n• Safety Precautions: Always wear appropriate protective gear during handling and application, following safety guidelines provided by the pesticide manufacturer.\r\n• Integrated Pest Management (IPM):\r\nIt's crucial to combine chemical treatments with other control methods, such as cultural practices and biological controls, for a more holistic approach to managing cabbage seed weevil infestations.",
  "pest_image": [
    "pesticides/chlorpyrifos.jpg"
  ]
},
{
  "_id": {
    "$oid": "6561fea4c9b0e3a20fdd61cb"
  },
  "name": "Strongyllodes variegatus",
  "p_image": "pest/40.jpg",
  "description": "Strongyllodes variegatus is a species of beetle that belongs to the family Nitidulidae. It is also known as the brown beetle or the oilseed rape beetle. It is a pest of brassicaceous crops, such as oilseed rape, cabbage, and mustard. It feeds on the flowers, buds, and leaves of these plants, creating holes and mines that reduce the photosynthesis and growth of the plants. It can also transmit viral diseases, such as rice stripe virus and rice black-streaked dwarf virus, to the plants.\r\nThe description of Strongyllodes variegatus is as follows:\r\n• The adult beetle is about 3 to 4 mm long and oval in shape. It has a shiny black body with a greenish tinge. It has transparent wings with a wavy amber line running along each wing cover (elytron). It has black eyes and antennae. It has yellow or black legs, depending on the population.\r\n• The eggs are white and laid in masses of 60 to 260 on the lower parts of the host plant, such as the midrib or the leaf sheath. They hatch into larvae, which are yellowish-green with black spots and long hairs. They feed on the leaf tissue and create mines that are initially narrow and linear, but later become wider and blotchy.\r\n• The larvae pupate in brown puparia within the mines or on the soil surface. The pupae are dark brown and have yellow hairs. The adult beetles emerge from the pupae after about two weeks.",
  "prevention": "• Cultural control: This involves crop rotation, intercropping, sanitation, and timely harvesting to break the pest cycle and reduce the pest infestation.\r\n• Mechanical control: This involves hand picking, trapping, and netting to collect and kill the adult beetles and larvae.\r\n• Biological control: This involves the use of natural enemies, such as parasitoids, predators, and pathogens, that can attack the beetles and larvae. For example, wasps, flies, beetles, spiders, birds, bats, fungi, and bacteria.",
  "pesticides": "1. Carbaryl\r\n2. Imidacloprid\r\n3. Metarhizium anisopliae\r\nThe application of pesticides for Strongyllodes variegatus should be done with proper technique, equipment, and safety precautions. Some of the guidelines are:\r\n• Follow the label instructions and local regulations for the pesticide use.\r\n• Apply the pesticide at the right time, rate, and frequency, depending on the pest stage and severity.\r\n• Apply the pesticide to the target area, avoiding drift and runoff to non-target areas.\r\n• Handle, store, and dispose of the pesticide in a safe and responsible manner, using protective clothing, gloves, and masks.\r\n• Wash yourself and your equipment after using the pesticide.\r\n• Monitor the pest population and the pesticide residues, and report any adverse effects to the authorities.",
  "pest_image": [
    "pesticides/carbaryl.jpg",
    "pesticides/metarhizium-anisopliae.jpg"
  ]
}]